---
type: MEPSupportUtils
namespace: Autodesk.Revit.DB
version: 2024
members: 1
tags: [revit-api, class]
---

# MEPSupportUtils

`Autodesk.Revit.DB.MEPSupportUtils` · Revit 2024 · 1 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Method | CreateDuctworkStiffener | 2024 | `public static FamilyInstance CreateDuctworkStiffener ( Document document , ElementId familySymbolId , ElementId hostId , double distanceFromHostEnd )` |